src/test/resources/fecharPedido.xml

<soapenv:Envelope
        xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:ser="http://services.senior.com.br">
    <soapenv:Body>
        <ser:SERVICE>
            <user>USER</user>
            <password>PSWD</password>
            <encryption>ENCRYPTION</encryption>
            <parameters>
                <pedido>
                    <fecPed>S</fecPed>
                    <parcelas>
                        <banOpe>01</banOpe>
                        <seqPar>1</seqPar>
                        <catTef>123123123</catTef>
                        <nsuTef></nsuTef>
                        <vlrPar>92,45</vlrPar>
                        <tipInt>2</tipInt>
                        <opeExe>I</opeExe>
                        <vctPar>11/09/2024</vctPar>
                        <cgcCre>999999999999</cgcCre>
                        <codFpg>8</codFpg>
                    </parcelas>
                    <parcelas>
                        <banOpe>01</banOpe>
                        <seqPar>2</seqPar>
                        <catTef>123123123</catTef>
                        <nsuTef></nsuTef>
                        <vlrPar>92,45</vlrPar>
                        <tipInt>2</tipInt>
                        <opeExe>I</opeExe>
                        <vctPar>11/10/2024</vctPar>
                        <cgcCre>999999999999</cgcCre>
                        <codFpg>8</codFpg>
                    </parcelas>
                    <numPed>123456</numPed>
                    <temPar>S</temPar>
                    <codEmp>1</codEmp>
                    <codFil>1</codFil>
                    <opeExe>A</opeExe>
                </pedido>
            </parameters>
        </ser:SERVICE>
    </soapenv:Body>
</soapenv:Envelope>